# -*- mode: ruby-ts -*-
# vim: filetype=ruby

# Shells
brew "nushell"
brew "elvish"
brew "fish"
brew "zsh"
brew "bash"

# Keymaps
cask "karabiner-elements"

# CLIs
brew "mise"             # Tool version manager
brew "keychain"         # Key manager
brew "uutils-coreutils" # Core utilities
brew "uutils-findutils" # Find utilities
brew "uutils-diffutils" # Diff utilities
# brew "devenv"           # Project manager # TODO: Enable this
brew "nginx"            # Web server and reverse proxy
brew "frpc"             # Expose local web server to internet
brew "zrok"             # Expose local web server to internet
cask "ngrok"            # Expose local web server to internet
brew "gh"               # GitHub client
brew "awscli"           # AWS client
brew "azure-cli"        # Azure client
cask "gcloud-cli"       # Google Cloud client
brew "ykman"            # YubiKey client
brew "helm"             # Kubernetes package manager
brew "stern"            # Kubernetes log explorer
brew "kubectx"          # Kubernetes context and namespace manager
brew "git"              # VCS # TODO: Remove this
brew "grep"             # Search files # TODO: Remove this
brew "make"             # Build system # TODO: Remove this
brew "gnupg"            # Encryption and signing # TODO: Remove this
brew "jq"               # JSON toolkit # TODO: Remove this
brew "prettier"         # Formatter # TODO: Remove this
brew "entr"             # File watcher # TODO: Remove this
brew "watchman"         # File watcher # TODO: Remove this
brew "pre-commit"       # Git hook manager # TODO: Remove this
brew "minisign"         # Signing # TODO: Remove this
brew "httpie"           # HTTP client # TODO: Remove this
brew "wget"             # HTTP client # TODO: Remove this
brew "curl"             # HTTP client # TODO: Remove this
brew "graphqurl"        # GraphQL client # TODO: Remove this
brew "mas"              # MacOS App Store application installer
brew "kubergrunt"       # Kubernetes integration with Helm and Terraform # TODO: Remove this
