# -*- mode: ruby-ts -*-
# vim: filetype=ruby

# Shells
brew "nushell"
brew "elvish"
brew "fish"
brew "zsh"
brew "bash"

# Keymaps
cask "karabiner-elements"

# CLIs
brew "mise"             # Tool version manager
brew "keychain"         # Key manager
brew "uutils-findutils" # Find utilities
brew "uutils-diffutils" # Diff utilities
brew "nginx"            # Web server and reverse proxy
cask "ngrok"            # Expose local web server to internet
brew "awscli"           # AWS client
brew "azure-cli"        # Azure client
cask "gcloud-cli"       # Google Cloud client
brew "ykman"            # YubiKey client
brew "git"              # VCS # TODO: Remove this
brew "grep"             # Search files # TODO: Remove this
brew "make"             # Build system # TODO: Remove this
brew "gnupg"            # Encryption and signing # TODO: Remove this
brew "entr"             # File watcher # TODO: Remove this
brew "watchman"         # File watcher # TODO: Remove this
brew "minisign"         # Signing # TODO: Remove this
brew "httpie"           # HTTP client # TODO: Remove this
brew "wget"             # HTTP client # TODO: Remove this
brew "curl"             # HTTP client # TODO: Remove this
brew "graphqurl"        # GraphQL client # TODO: Remove this
brew "mas"              # MacOS App Store application installer

# TUISs
brew "htop" # System monitor # TODO: Remove this
brew "btop" # System monitor # TODO: Remove this
brew "glances" # System monitor # TODO: Remove this

# GUIs
brew "pinentry-mac"                            # Passphrase dialog
cask "firefox@developer-edition"               # Browser
cask "brave-browser"                           # Browser
cask "firefox"                                 # Browser
cask "zen"                                     # Browser
cask "alacritty"                               # Terminal
cask "wezterm"                                 # Terminal
cask "iterm2"                                  # Terminal
cask "wave"                                    # Terminal
cask "ghostty"                                 # Terminal
cask "emacs-app"                               # Text editor
cask "neovide-app"                             # Text editor
cask "zed"                                     # Text editor
cask "vscodium"                                # Text editor
cask "void"                                    # Text editor
cask "logseq"                                  # Note taker
cask "element"                                 # Instant messenger
cask "signal"                                  # Instant messenger
cask "keybase"                                 # Instant messenger
cask "bitwarden"                               # Password manager
cask "proton-pass"                             # Password manager
cask "proton-mail"                             # Mail
cask "insomnia"                                # API client
cask "dbeaver-community"                       # DB client
cask "proton-drive"                            # Cloud storage
cask "protonvpn"                               # VPN
cask "mockoon"                                 # Mock server
cask "raycast"                                 # Application launcher
cask "podman-desktop"                          # Podman client
cask "openlens"                                # Kubernetes client
# thebrowsercompany-dia = { arch = "aarch64" } # Browser # TODO: Remove arch restriction
cask "arc"                                     # Browser
cask "google-chrome"                           # Browser
cask "warp"                                    # Terminal
cask "visual-studio-code"                      # Text editor
cask "obsidian"                                # Note taker
cask "notion"                                  # Note taker
cask "microsoft-onenote"                       # Note taker
cask "cursor"                                  # Text editor
cask "windsurf"                                # Text editor
cask "discord"                                 # Instant messenger
cask "slack"                                   # Instant messenger
cask "microsoft-teams"                         # Instant messenger
cask "1password"                               # Password manager
cask "readdle-spark"                           # Mail
cask "notion-mail"                             # Mail
cask "notion-calendar"                         # Calendar
cask "microsoft-outlook"                       # Mail
cask "ticktick"                                # Reminder
cask "linear-linear"                           # Issue tracker
cask "zoom"                                    # Video caller
cask "postman"                                 # API client
cask "tableplus"                               # DB client
cask "dropbox"                                 # Cloud storage
cask "nordvpn"                                 # VPN
cask "figma"                                   # Design
cask "microsoft-word"                          # Word processing
cask "microsoft-excel"                         # Spreadsheet
cask "microsoft-powerpoint"                    # Presentation
cask "gitkraken"                               # Git client
cask "docker-desktop"                          # Docker client
cask "lens"                                    # Kubernetes client
cask "yubico-authenticator"                    # TOTP generator
cask "goland"                                  # IDE
# chatgpt = { arch = "aarch64" }               # GenAI # TODO: Remove arch restriction
cask "claude"                                  # GenAI
mas "Saber", id: 1671523739                    # Handwritten note taker # TODO: Move these to casks
mas "Numbers", id: 409203825                   # Spreadsheet # TODO: Move these to casks
mas "Pages", id: 409201541                     # Word processing # TODO: Move these to casks
mas "Keynote", id: 409183694                   # Presentation # TODO: Move these to casks
mas "Goodnotes", id: 1444383602                # Handwritten note taker # TODO: Move these to casks
mas "Notability", id: 360593530                # Handwritten note taker # TODO: Move these to casks
mas "Perplexity", id: 6714467650               # GenAI # TODO: Move these to casks

# Lua
brew "luacheck" # Linter # TODO: Move this to mise packages

# Fennel
brew "fnlfmt" # Formatter # TODO: Move this to mise packages

# Haskell
brew "haskell-language-server" # Language server # TODO: Move this to mise packages
brew "hlint"                   # Linter # TODO: Move this to mise packages
brew "fourmolu"                # Formatter # TODO: Move this to mise packages

# # Nix
# nil # Language server
# statix # Linter # TODO: Install deadnix as well
# nixfmt # Formatter
#
# # Scala
# metals # Language server
# scalafix # Linter
# scalafmt # Formatter
#
# # Kotlin
# kotlin-language-server # Language server
# ktlint # Linter
# ktfmt # Formatter
#
# # PureScript
# spago # Package manager
# nodePackages.purescript-language-server # Language server
# # TODO: Setup linter
# nodePackages.purs-tidy # Formatter
#
# # ClojureScript
# # TODO: Setup toolchain
#
# # C++
# clang-tools # Language server and formatter
# cppcheck # Linter
#
# # Typst
# typst # Toolchain
#
# # Mermaid
# mermaid-cli # Toolchain
